Repository: astralchen/AzureFish
Catalog: AzureFish/Localizable.xcstrings
Source language: en
Languages: ar, zh_hans, zh_hant

# account.security.resultUnknown
source: The deletion result could not be recovered. Local encrypted data has been kept. Sign in to check the account status.
ar: تعذّر استعادة نتيجة الحذف. تم الاحتفاظ بالبيانات المحلية المشفرة. سجّل الدخول للتحقق من حالة الحساب.
zh_hans: 无法恢复删除结果，已保留本机加密数据。请登录确认账号状态。
zh_hant: 無法復原刪除結果，已保留本機加密資料。請登入確認帳號狀態。

# chat.permission.microphone
source: Allow microphone access in Settings, then try recording again.
ar: اسمح بالوصول إلى الميكروفون في الإعدادات ثم حاول التسجيل مجددًا.
zh_hans: 请在系统设置中允许麦克风访问，然后重新录音。
zh_hant: 請在系統設定中允許麥克風存取，然後重新錄音。

# chat.permission.settings
source: Open Settings
ar: فتح الإعدادات
zh_hans: 打开设置
zh_hant: 開啟設定

# chat.media.export
source: Save or share attachments
ar: حفظ المرفقات أو مشاركتها
zh_hans: 保存或分享附件
zh_hant: 儲存或分享附件

# account.deletedUser
source: Deleted user
ar: مستخدم محذوف
zh_hans: 已注销用户
zh_hant: 已註銷使用者

# account.deletion.accepted
source: Deletion accepted. Server cleanup may still be in progress. History already received by other members is retained.
ar: تم قبول طلب الحذف. قد يستمر التنظيف على الخادم. يحتفظ الأعضاء الآخرون بالسجل الذي استلموه.
zh_hans: 删除申请已受理。服务端清理可能仍在进行，其他成员已接收的历史记录会保留。
zh_hant: 刪除申請已受理。伺服器清理可能仍在進行，其他成員已接收的歷史記錄會保留。

# account.security.completed
source: Done. Please sign in again.
ar: تمت العملية. يرجى تسجيل الدخول مجددًا.
zh_hans: 操作成功，请重新登录。
zh_hant: 操作成功，請重新登入。

# account.security.reauthenticate
source: Verification expired. Enter your current password and try again.
ar: انتهت صلاحية التحقق. أدخل كلمة المرور الحالية وحاول مجددًا.
zh_hans: 身份确认已过期，请重新输入当前密码再试。
zh_hant: 身分確認已過期，請重新輸入目前密碼再試。

# account.security.currentPassword
source: Current password
ar: كلمة المرور الحالية
zh_hans: 当前密码
zh_hant: 目前密碼

# account.security.newPassword
source: New password
ar: كلمة المرور الجديدة
zh_hans: 新密码
zh_hant: 新密碼

# account.security.logoutHelp
source: All devices, including this one, will be signed out. Encrypted chat history on this device is retained.
ar: سيتم تسجيل الخروج من جميع الأجهزة، بما فيها هذا الجهاز. سيُحتفظ بسجل المحادثات المشفر على هذا الجهاز.
zh_hans: 此操作成功后，所有设备（包括当前设备）都会退出登录。本机加密聊天记录会保留。
zh_hant: 此操作成功後，所有裝置（包括目前裝置）都會登出。本機加密聊天記錄會保留。

# account.security.deleteHelp
source: Your account will be disabled and your profile, avatar and local data removed. Other members retain received history. This cannot be undone. Transfer or dissolve groups you own first.
ar: سيُعطّل حسابك وتُحذف معلوماتك وصورتك وبياناتك المحلية. يحتفظ الآخرون بالسجل المستلم. لا يمكن التراجع. انقل ملكية مجموعاتك أو حلّها أولًا.
zh_hans: 删除后账号将停用，个人资料、头像和本机数据将清除。其他成员保留已接收的历史记录。此操作不可撤销，请先处理你管理的群聊。
zh_hant: 刪除後帳號將停用，個人資料、頭像和本機資料將清除。其他成員保留已接收的歷史記錄。此操作無法復原，請先處理你管理的群組。

# account.security.ownedGroups
source: Transfer or dissolve these groups before deleting your account.
ar: انقل ملكية هذه المجموعات أو حلّها قبل حذف حسابك.
zh_hans: 请先转让或解散以下群聊，再返回删除账号。
zh_hant: 請先轉讓或解散以下群組，再返回刪除帳號。

# account.avatar.help
source: Your avatar updates after confirmation. Cancelling text edits does not undo an avatar change.
ar: تُحدّث الصورة بعد التأكيد. إلغاء تعديلات النص لا يلغي تغيير الصورة.
zh_hans: 头像确认后立即更新，取消文字编辑不会撤销头像修改。
zh_hant: 確認頭像後立即更新，取消文字編輯不會復原頭像修改。

# account.avatar.choose
source: Choose photo
ar: اختيار صورة
zh_hans: 选择照片
zh_hant: 選擇照片

# account.avatar.reset
source: Restore default avatar
ar: استعادة الصورة الافتراضية
zh_hans: 恢复默认头像
zh_hant: 恢復預設頭像

# account.avatar.use
source: Use this avatar
ar: استخدام هذه الصورة
zh_hans: 使用此头像
zh_hant: 使用此頭像

# account.avatar.preview
source: Avatar preview
ar: معاينة الصورة
zh_hans: 头像预览
zh_hant: 頭像預覽

# account.avatar.invalid
source: This photo could not be read. Choose another photo.
ar: تعذّر قراءة هذه الصورة. اختر صورة أخرى.
zh_hans: 无法读取这张照片，请选择其他照片。
zh_hant: 無法讀取這張照片，請選擇其他照片。

# chat.draft.saveFailed
source: Draft not saved. Please retry.
ar: لم تُحفظ المسودة. يرجى المحاولة مجددًا.
zh_hans: 草稿尚未保存，请重试。
zh_hant: 草稿尚未儲存，請重試。

# chat.list.draftMarker
source: [Draft]
ar: [مسودة]
zh_hans: [草稿]
zh_hant: [草稿]

# chat.list.draftPreview
source: [Draft] %@
ar: [مسودة] %@
zh_hans: [草稿] %@
zh_hant: [草稿] %@

# chat.list.draftAttachments
source: Unsent attachments
ar: مرفقات غير مرسلة
zh_hans: 未发送的附件
zh_hant: 未傳送的附件

# chat.list.expandPinned
source: Expand pinned chats
ar: توسيع المحادثات المثبّتة
zh_hans: 展开置顶聊天
zh_hant: 展開置頂聊天

# chat.list.collapsePinned
source: Collapse pinned chats
ar: طيّ المحادثات المثبّتة
zh_hans: 折叠置顶聊天
zh_hant: 摺疊置頂聊天

# chat.list.pinnedSummary
source: Pinned chats: %@ · Unread chats: %@
ar: المحادثات المثبّتة: %@ · المحادثات غير المقروءة: %@
zh_hans: 置顶聊天：%@ · 未读聊天：%@
zh_hant: 置頂聊天：%@ · 未讀聊天：%@

# chat.list.markUnread
source: Mark as Unread
ar: تمييز كغير مقروء
zh_hans: 标记未读
zh_hant: 標記未讀

# chat.list.manuallyUnread
source: Marked as unread
ar: مميّزة كغير مقروءة
zh_hans: 已标记为未读
zh_hant: 已標記為未讀

# chat.list.hide
source: Hide
ar: إخفاء
zh_hans: 不显示
zh_hant: 不顯示

# chat.list.delete
source: Delete
ar: حذف
zh_hans: 删除
zh_hant: 刪除

# chat.list.deleteTitle
source: Delete Chat?
ar: حذف المحادثة؟
zh_hans: 删除聊天？
zh_hant: 刪除聊天？

# chat.list.deleteHelp
source: This clears chat history on this device and removes the chat from the list. Drafts and pending messages are kept. Your contact and group membership are unchanged. The chat reappears when you send or receive a new message.
ar: سيُمسح سجل المحادثة على هذا الجهاز وتُزال المحادثة من القائمة. ستبقى المسودات والرسائل قيد الإرسال، ولن تُحذف جهة الاتصال ولن تغادر المجموعة. ستظهر المحادثة مجددًا عند إرسال رسالة جديدة أو استقبالها.
zh_hans: 将清空本机聊天记录并从列表移除。草稿和待发送内容会保留，不会删除好友或退出群聊。收到或发送新消息后会重新显示。
zh_hant: 將清空本機聊天記錄並從列表移除。草稿和待傳送內容會保留，不會刪除好友或退出群組。收到或傳送新訊息後會重新顯示。

# chat.live.revokeFailed
source: Couldn’t recall the message. The original message is kept.
ar: تعذّر سحب الرسالة. تم الاحتفاظ بالرسالة الأصلية.
zh_hans: 未能撤回消息，原消息已保留
zh_hant: 未能收回訊息，原訊息已保留

# chat.live.revokeConfirming
source: Confirming the recall result. Please check again shortly.
ar: جارٍ التحقق من نتيجة سحب الرسالة. يُرجى التحقق بعد قليل.
zh_hans: 正在确认撤回结果，请稍后查看
zh_hant: 正在確認收回結果，請稍後查看

# chat.live.revokedSelf
source: You recalled a message
ar: لقد سحبت رسالة
zh_hans: 你撤回了一条消息
zh_hant: 你撤回了一則訊息

# chat.live.revokedOther
source: The other person recalled a message
ar: سحب الطرف الآخر رسالة
zh_hans: 对方撤回了一条消息
zh_hant: 對方撤回了一則訊息

# chat.live.revokedMember
source: %@ recalled a message
ar: سحب %@ رسالة
zh_hans: %@撤回了一条消息
zh_hant: %@撤回了一則訊息

# chat.live.reedit
source: Edit again
ar: إعادة التحرير
zh_hans: 重新编辑
zh_hant: 重新編輯

# chat.live.replaceDraftTitle
source: Replace the current draft?
ar: هل تريد استبدال المسودة الحالية؟
zh_hans: 替换当前草稿？
zh_hant: 取代目前的草稿？

# chat.live.replaceDraftBody
source: Your current text will be replaced with the recalled message. Selected attachments will be kept.
ar: سيُستبدل النص الحالي بالرسالة المسحوبة، مع الاحتفاظ بالمرفقات المحددة.
zh_hans: 当前文字将替换为撤回的内容，已选附件会保留。
zh_hant: 目前文字將替換為收回的內容，已選附件會保留。

# chat.live.replaceDraft
source: Replace
ar: استبدال
zh_hans: 替换
zh_hant: 取代

# chat.live.reeditExpired
source: The editing window has expired
ar: انتهت مهلة إعادة التحرير
zh_hans: 已超过重新编辑时限
zh_hant: 已超過重新編輯時限

# chat.live.reeditUnavailable
source: The original text is unavailable for editing
ar: النص الأصلي غير متاح لإعادة التحرير
zh_hans: 原文暂时不可用，无法重新编辑
zh_hant: 原文暫時無法使用，無法重新編輯

# chat.live.revokeNoRecovery
source: Message recalled, but editing is unavailable
ar: سُحبت الرسالة، لكن إعادة التحرير غير متاحة
zh_hans: 消息已撤回，但无法重新编辑
zh_hant: 訊息已收回，但無法重新編輯

# chat.live.preparing
source: Preparing
ar: جارٍ التحضير
zh_hans: 准备中
zh_hant: 準備中

# chat.live.uploading
source: Uploading
ar: جارٍ الرفع
zh_hans: 上传中
zh_hant: 上傳中

# chat.live.processing
source: Processing
ar: جارٍ المعالجة
zh_hans: 服务端处理中
zh_hant: 伺服器處理中

# chat.live.cancelling
source: Cancelling
ar: جارٍ الإلغاء
zh_hans: 正在取消
zh_hant: 正在取消

# chat.live.transfer
source: Media transfer
ar: نقل الوسائط
zh_hans: 媒体发送任务
zh_hant: 媒體傳送任務

# chat.live.recordAgain
source: Record again
ar: إعادة التسجيل
zh_hans: 重新录制
zh_hant: 重新錄製

# chat.live.download
source: Download original
ar: تنزيل الأصل
zh_hans: 下载原件
zh_hant: 下載原件

# chat.live.receipts
source: Message receipts
ar: إيصالات الرسائل
zh_hans: 消息回执
zh_hant: 訊息回執

# chat.live.unknown
source: Unsupported message
ar: رسالة غير مدعومة
zh_hans: 此消息暂不支持显示
zh_hant: 此訊息暫不支援顯示

# chat.live.contacts
source: Contacts
ar: جهات الاتصال
zh_hans: 通讯录
zh_hant: 通訊錄

# chat.live.newFriends
source: Friend requests
ar: طلبات الصداقة
zh_hans: 新的朋友
zh_hant: 新的朋友

# chat.live.addFriend
source: Add friend
ar: إضافة صديق
zh_hans: 添加好友
zh_hant: 加入好友

# chat.live.addHelp
source: Enter the exact account name, review the profile, then send a friend request.
ar: أدخل اسم الحساب كاملًا، وراجع الملف الشخصي، ثم أرسل طلب صداقة.
zh_hans: 输入完整账号，确认资料后发送好友申请。
zh_hant: 輸入完整帳號，確認資料後傳送好友申請。

# chat.live.lookup
source: Find account
ar: البحث عن حساب
zh_hans: 查找
zh_hant: 尋找

# chat.live.lookupFailed
source: Could not find this account. Check the name and your connection.
ar: تعذر العثور على هذا الحساب. تحقق من الاسم والاتصال.
zh_hans: 无法找到该账号，请检查输入或网络。
zh_hant: 無法找到該帳號，請檢查輸入或網路。

# chat.live.friendProfile
source: Friend profile
ar: ملف الصديق
zh_hans: 好友详情
zh_hant: 好友詳細資料

# chat.live.request
source: Send friend request
ar: إرسال طلب صداقة
zh_hans: 发送好友申请
zh_hant: 傳送好友申請

# chat.live.accept
source: Accept
ar: قبول
zh_hans: 接受
zh_hant: 接受

# chat.live.reject
source: Decline
ar: رفض
zh_hans: 拒绝
zh_hant: 拒絕

# chat.live.cancelRequest
source: Cancel request
ar: إلغاء الطلب
zh_hans: 取消申请
zh_hant: 取消申請

# chat.live.deleteFriend
source: Remove friend
ar: إزالة الصديق
zh_hans: 删除好友
zh_hant: 刪除好友

# chat.live.deleteHelp
source: Remove this person from your contacts only. History and drafts are kept. New private messages pause for both of you. Adding them again restores contact immediately if they still keep you.
ar: تُزال جهة الاتصال من قائمتك فقط ويُحفظ السجل والمسودات. تتوقف الرسائل الخاصة الجديدة لكليكما. تعيد الإضافة العلاقة فورًا إذا كان الطرف الآخر لا يزال يحتفظ بك.
zh_hans: 仅从你的通讯录移除对方，历史记录和草稿保留。双方将暂停新的私聊；若对方仍保留你，重新添加可直接恢复。
zh_hant: 僅從你的通訊錄移除對方，歷史紀錄與草稿保留。雙方將暫停新的私訊；若對方仍保留你，重新加入即可恢復。

# chat.live.friend
source: Friends
ar: صديقان
zh_hans: 已成为好友
zh_hant: 已成為好友

# chat.live.none
source: Not friends yet
ar: لستما صديقين بعد
zh_hans: 还不是好友
zh_hant: 尚未成為好友

# chat.live.pending
source: Awaiting confirmation
ar: بانتظار التأكيد
zh_hans: 等待确认
zh_hant: 等待確認

# chat.live.rejected
source: Request declined
ar: تم رفض الطلب
zh_hans: 申请已拒绝
zh_hant: 申請已拒絕

# chat.live.cancelled
source: Request cancelled
ar: تم إلغاء الطلب
zh_hans: 申请已取消
zh_hant: 申請已取消

# chat.live.deleted
source: Friendship ended
ar: انتهت الصداقة
zh_hans: 已解除好友关系
zh_hant: 已解除好友關係

# chat.live.incoming
source: Received request
ar: طلب وارد
zh_hans: 收到的申请
zh_hant: 收到的申請

# chat.live.outgoing
source: Sent request
ar: طلب مُرسل
zh_hans: 发出的申请
zh_hant: 送出的申請

# chat.live.search
source: Search
ar: بحث
zh_hans: 搜索
zh_hant: 搜尋

# chat.live.emptyContacts
source: Start with a friend
ar: ابدأ بإضافة صديق
zh_hans: 从一位好友开始
zh_hant: 從一位好友開始

# chat.live.emptyChats
source: No conversations yet
ar: لا توجد محادثات بعد
zh_hans: 还没有会话
zh_hant: 還沒有對話

# chat.live.startHelp
source: Use the plus button to start a conversation with a friend.
ar: استخدم زر الإضافة لبدء محادثة مع صديق.
zh_hans: 点击右上角的加号，从好友中发起聊天。
zh_hant: 點一下右上角的加號，從好友中開始聊天。

# chat.live.newChat
source: New chat
ar: محادثة جديدة
zh_hans: 发起聊天
zh_hant: 開始聊天

# chat.live.newGroup
source: New group
ar: مجموعة جديدة
zh_hans: 创建群聊
zh_hant: 建立群組

# chat.live.groupName
source: Group name
ar: اسم المجموعة
zh_hans: 群名称
zh_hant: 群組名稱

# chat.live.create
source: Create
ar: إنشاء
zh_hans: 创建
zh_hant: 建立

# chat.live.next
source: Next
ar: التالي
zh_hans: 下一步
zh_hant: 下一步

# chat.live.selected
source: Selected
ar: تم التحديد
zh_hans: 已选择
zh_hant: 已選取

# chat.live.selectConversation
source: Select a conversation
ar: اختر محادثة
zh_hans: 选择一个会话开始聊天
zh_hant: 選取一個對話開始聊天

# chat.live.privateChat
source: Private chat
ar: محادثة خاصة
zh_hans: 私聊
zh_hant: 私人對話

# chat.live.sendMessage
source: Send message
ar: إرسال رسالة
zh_hans: 发消息
zh_hant: 傳送訊息

# chat.live.unread
source: Unread
ar: غير مقروء
zh_hans: 未读
zh_hant: 未讀

# chat.live.history
source: Load earlier messages
ar: تحميل رسائل أقدم
zh_hans: 加载更早消息
zh_hant: 載入較早訊息

# chat.live.latest
source: Latest messages
ar: أحدث الرسائل
zh_hans: 回到最新
zh_hant: 回到最新

# chat.live.sent
source: Sent
ar: تم الإرسال
zh_hans: 已发送
zh_hant: 已傳送

# chat.live.delivered
source: Delivered
ar: تم التسليم
zh_hans: 已送达
zh_hant: 已送達

# chat.live.read
source: Read
ar: تمت القراءة
zh_hans: 已读
zh_hant: 已讀

# chat.live.waiting
source: Waiting for connection
ar: بانتظار الاتصال
zh_hans: 等待网络
zh_hant: 等待網路

# chat.live.sending
source: Sending
ar: جارٍ الإرسال
zh_hans: 发送中
zh_hant: 傳送中

# chat.live.confirming
source: Confirming delivery to server
ar: جارٍ تأكيد استلام الخادم
zh_hans: 确认发送结果
zh_hant: 確認傳送結果

# chat.live.failed
source: Could not complete this action. Your content is kept. Try again.
ar: تعذر إكمال الإجراء. تم الاحتفاظ بالمحتوى. حاول مجددًا.
zh_hans: 操作未完成，内容已保留，请重试。
zh_hant: 操作未完成，內容已保留，請重試。

# chat.live.offline
source: Offline. Showing saved content; syncing will resume when connected.
ar: أنت غير متصل. يُعرض المحتوى المحفوظ وستُستأنف المزامنة عند الاتصال.
zh_hans: 当前离线，显示已保存内容。联网后继续同步。
zh_hant: 目前離線，顯示已儲存內容。連線後繼續同步。

# chat.live.storageFailure
source: Could not open encrypted chat data. Check device storage and keys.
ar: تعذر فتح بيانات المحادثة المشفرة. تحقق من مساحة الجهاز والمفاتيح.
zh_hans: 无法打开聊天加密数据，请检查设备存储与密钥。
zh_hant: 無法開啟聊天加密資料，請檢查裝置儲存空間與金鑰。

# chat.live.friendRequired
source: Complete friend verification before sending private messages. History and drafts are kept.
ar: أكمل تأكيد الصداقة قبل إرسال رسائل خاصة. حُفظ السجل والمسودات.
zh_hans: 当前关系不支持发送私聊。请先完成好友验证；历史和草稿已保留。
zh_hant: 目前關係無法傳送私訊。請先完成好友驗證；歷史與草稿已保留。

# chat.live.closed
source: This conversation is closed. History and drafts are kept.
ar: أُغلقت هذه المحادثة. تم الاحتفاظ بالسجل والمسودات.
zh_hans: 此会话已关闭，历史和草稿仍保留。
zh_hant: 此對話已關閉，歷史與草稿仍保留。

# chat.live.changed
source: Details changed on another device. Review the latest state and try again.
ar: تغيرت التفاصيل على جهاز آخر. راجع الحالة الحالية وحاول مجددًا.
zh_hans: 资料已在其他设备更新，请确认最新状态后重试。
zh_hant: 資料已在其他裝置更新，請確認最新狀態後重試。

# chat.live.notFound
source: Account not found
ar: الحساب غير موجود
zh_hans: 没有找到该账号
zh_hant: 找不到該帳號

# chat.live.selfContact
source: You cannot add yourself
ar: لا يمكنك إضافة نفسك
zh_hans: 不能添加自己为好友
zh_hant: 無法將自己加入好友

# chat.live.rateLimited
source: Too many requests. Try again shortly.
ar: طلبات كثيرة. حاول مجددًا بعد قليل.
zh_hans: 操作过于频繁，请稍后重试。
zh_hant: 操作過於頻繁，請稍後再試。

# chat.live.copy
source: Copy
ar: نسخ
zh_hans: 复制
zh_hant: 複製

# chat.live.localDelete
source: Delete on this device
ar: حذف من هذا الجهاز
zh_hans: 仅本机删除
zh_hant: 僅從本機刪除

# chat.live.revoke
source: Recall message
ar: سحب الرسالة
zh_hans: 撤回消息
zh_hant: 收回訊息

# chat.live.revoked
source: Message recalled
ar: تم سحب الرسالة
zh_hans: 消息已撤回
zh_hant: 訊息已收回

# chat.live.retry
source: Retry
ar: إعادة المحاولة
zh_hans: 重试
zh_hant: 重試

# chat.live.open
source: Open
ar: فتح
zh_hans: 打开
zh_hant: 開啟

# chat.live.cancel
source: Cancel
ar: إلغاء
zh_hans: 取消
zh_hant: 取消

# chat.live.attach
source: Add attachment
ar: إضافة مرفق
zh_hans: 添加附件
zh_hant: 加入附件

# chat.live.photos
source: Photos and videos
ar: الصور والفيديوهات
zh_hans: 照片与视频
zh_hant: 照片與影片

# chat.live.image
source: Image
ar: صورة
zh_hans: 图片
zh_hant: 圖片

# chat.live.video
source: Video
ar: فيديو
zh_hans: 视频
zh_hant: 影片

# chat.live.live_photo
source: Live Photo
ar: صورة حية
zh_hans: 实况照片
zh_hant: 原況照片

# chat.live.audio
source: Voice message
ar: رسالة صوتية
zh_hans: 语音
zh_hant: 語音

# chat.live.file
source: File
ar: ملف
zh_hans: 文件
zh_hant: 檔案

# chat.live.media_group
source: Media group
ar: مجموعة وسائط
zh_hans: 媒体组
zh_hant: 媒體群組

# chat.live.reviewAttachments
source: Review and reorder attachments
ar: مراجعة المرفقات وترتيبها
zh_hans: 查看与排序附件
zh_hant: 檢視與排序附件

# chat.live.splitHelp
source: Text is sent separately first. Photos, videos and Live Photos form one media message. Voice and files are sent separately.
ar: يُرسل النص أولًا بشكل منفصل. تُجمع الصور والفيديوهات والصور الحية في رسالة وسائط واحدة، وتُرسل الرسائل الصوتية والملفات منفصلة.
zh_hans: 文字先单独发送。照片、视频和实况照片合成一条媒体消息；语音和文件分别发送。
zh_hant: 文字會先單獨傳送。照片、影片與原況照片合為一則媒體訊息；語音與檔案分別傳送。

# chat.live.moveEarlier
source: Move earlier
ar: نقل إلى الأمام
zh_hans: 向前移动
zh_hant: 向前移動

# chat.live.moveLater
source: Move later
ar: نقل إلى الخلف
zh_hans: 向后移动
zh_hant: 向後移動

# chat.live.remove
source: Remove
ar: إزالة
zh_hans: 移除
zh_hant: 移除

# chat.live.record
source: Record voice
ar: تسجيل رسالة صوتية
zh_hans: 录制语音
zh_hant: 錄製語音

# chat.live.voicePreview
source: Review recording
ar: مراجعة التسجيل
zh_hans: 试听语音
zh_hant: 試聽語音

# chat.live.listen
source: Listen
ar: استماع
zh_hans: 试听
zh_hant: 試聽

# chat.live.keepRecording
source: Add to draft
ar: إضافة إلى المسودة
zh_hans: 加入待发送内容
zh_hant: 加入待傳送內容

# chat.live.details
source: Chat Details
ar: تفاصيل المحادثة
zh_hans: 聊天详情
zh_hant: 聊天詳情

# chat.live.groupMember
source: Group member
ar: عضو المجموعة
zh_hans: 群成员
zh_hant: 群組成員

# chat.live.owner
source: Group owner
ar: مالك المجموعة
zh_hans: 群主
zh_hant: 群組擁有者

# chat.live.rename
source: Rename group
ar: تغيير اسم المجموعة
zh_hans: 修改群名
zh_hant: 變更群組名稱

# chat.live.addMembers
source: Add members
ar: إضافة أعضاء
zh_hans: 添加成员
zh_hant: 加入成員

# chat.live.removeMember
source: Remove member
ar: إزالة عضو
zh_hans: 移除成员
zh_hant: 移除成員

# chat.live.removeHelp
source: This member will no longer be able to send messages. Authorized history stays available.
ar: لن يتمكن هذا العضو من إرسال الرسائل. يبقى السجل المصرح به متاحًا.
zh_hans: 该成员将无法继续发送消息，授权历史仍然保留。
zh_hant: 該成員將無法繼續傳送訊息，授權歷史仍然保留。

# chat.live.transferOwner
source: Transfer ownership
ar: نقل الملكية
zh_hans: 转让群主
zh_hant: 轉移群組擁有權

# chat.live.transferHelp
source: Transfer group management permissions to this member?
ar: هل تريد نقل صلاحيات إدارة المجموعة إلى هذا العضو؟
zh_hans: 确认将群管理权限转交给这位成员？
zh_hant: 確定要將群組管理權限轉交給這位成員？

# chat.live.leave
source: Leave group
ar: مغادرة المجموعة
zh_hans: 退出群聊
zh_hant: 退出群組

# chat.live.dissolve
source: Dissolve group
ar: حل المجموعة
zh_hans: 解散群聊
zh_hant: 解散群組

# chat.live.groupCloseHelp
source: After this action, you cannot send messages in this group. Authorized history is kept.
ar: بعد هذا الإجراء لن تتمكن من إرسال رسائل في هذه المجموعة. يبقى السجل المصرح به محفوظًا.
zh_hans: 操作后不能继续在此群发送消息。已获授权的历史记录会保留。
zh_hant: 操作後將無法繼續在此群組傳送訊息。已獲授權的歷史紀錄會保留。

# chat.live.clearLocal
source: Clear Local Chat History
ar: مسح سجل المحادثة المحلي
zh_hans: 清空本地聊天记录
zh_hant: 清除本機聊天記錄

# chat.live.clearHelp
source: Hide chat history up to the current message on this device, including older history loaded later. Other people’s records, drafts, pending messages, membership and read status stay unchanged.
ar: إخفاء سجل المحادثة حتى الرسالة الحالية على هذا الجهاز، بما في ذلك السجل الأقدم الذي يُحمّل لاحقًا. لا تتغير سجلات الآخرين أو المسودات أو الرسائل المعلقة أو العضوية أو حالة القراءة.
zh_hans: 清空本设备截至当前的聊天记录，之后补拉的旧记录也会隐藏。不会删除对方记录、草稿、待发送内容，也不会退出群聊或改变已读状态。
zh_hant: 清除本機截至目前的聊天記錄，之後補載的舊記錄也會隱藏。不會刪除對方記錄、草稿或待傳送內容，也不會退出群組或變更已讀狀態。

# account.cache.damaged
source: Local data couldn’t be read securely. Retry or review recovery guidance. Existing data will not be replaced with an empty profile.
ar: تعذّر قراءة البيانات المحلية بأمان. أعد المحاولة أو راجع إرشادات الاستعادة. لن تُستبدل بياناتك بملف فارغ.
zh_hans: 无法安全读取本机资料。请重试或查看恢复说明，原有数据不会被空资料覆盖。
zh_hant: 無法安全讀取本機資料。請重試或查看復原說明，原有資料不會被空白資料覆寫。

# account.cache.key
source: Keep existing data. Unlock the device and retry. If it remains unavailable, preserve the original files and seek support. Do not overwrite them.
ar: احتفظ ببياناتك. افتح قفل الجهاز وحاول مجددًا. إذا استمرت المشكلة، حافظ على الملفات الأصلية واطلب الدعم دون استبدالها.
zh_hans: 保留当前数据。确认设备已解锁后重试；若仍不可用，请保留原文件并寻求支持。不要覆盖或重建为空数据。
zh_hant: 保留目前資料。確認裝置已解鎖後重試；若仍無法使用，請保留原始檔案並尋求支援。請勿覆寫或重建為空白資料。

# account.cancel.auth
source: Your input will be cleared. A request already sent may have completed on the server.
ar: ستُمسح مدخلاتك. ربما اكتمل طلب أُرسل بالفعل على الخادم.
zh_hans: 未提交的输入会被清除。已发送的请求可能已在服务器完成。
zh_hant: 尚未送出的輸入將被清除。已傳送的要求可能已在伺服器完成。

# account.cancelled
source: The action wasn’t completed. Try again or cancel.
ar: لم يكتمل الإجراء. حاول مجددًا أو ألغِه.
zh_hans: 操作未完成，请重试或取消。
zh_hant: 操作未完成，請重試或取消。

# account.conflict
source: Your edits are retained. Load the latest profile, then review and save again.
ar: لم تفقد تعديلاتك. حمّل أحدث نسخة ثم راجع التغييرات واحفظها مجددًا.
zh_hans: 你的编辑仍保留。载入最新资料后，可以重新确认并保存。
zh_hant: 你的編輯仍保留。載入最新資料後，可以重新確認並儲存。

# account.conflict.confirmed
source: Latest version confirmed. Review your draft and save.
ar: تم تأكيد أحدث نسخة. راجع مسودتك واحفظها.
zh_hans: 已确认最新版本，请检查草稿并保存。
zh_hant: 已確認最新版本，請檢查草稿並儲存。

# account.conflict.review
source: Latest display name: %@ Latest bio: %@ Your draft is retained. Confirm this version, then tap Save again.
ar: أحدث اسم ظاهر: %@ أحدث نبذة: %@ مسودتك محفوظة. أكد هذه النسخة ثم اضغط حفظ مجددًا.
zh_hans: 最新昵称：%@ 最新简介：%@ 你的草稿已保留。确认以此版本为基础，再次点保存。
zh_hant: 最新暱稱：%@ 最新簡介：%@ 已保留你的草稿。確認以此版本為基礎，再點一下儲存。

# account.credentials.invalid
source: The account name or password is incorrect. Try again.
ar: اسم الحساب أو كلمة المرور غير صحيحة. حاول مجددًا.
zh_hans: 账号或密码不正确，请重试。
zh_hant: 帳號或密碼不正確，請重試。

# account.debug.only
source: Demo state · No server operations
ar: حالة تجريبية · لا تُرسل إجراءات للخادم
zh_hans: 演示状态 · 不会提交服务器操作
zh_hant: 示範狀態 · 不會送出伺服器操作

# account.default.avatar
source: Default profile photo
ar: الصورة الشخصية الافتراضية
zh_hans: 默认头像
zh_hant: 預設頭像

# account.design.account
source: Account name
ar: اسم الحساب
zh_hans: 账号
zh_hant: 帳號

# account.design.accountLogin
source: Sign in with account
ar: الدخول بالحساب
zh_hans: 使用账号登录
zh_hant: 使用帳號登入

# account.design.accountRule
source: 3–32 lowercase Latin letters, numbers or underscores.
ar: من 3 إلى 32 حرفًا لاتينيًا صغيرًا أو رقمًا أو شرطة سفلية.
zh_hans: 3～32 位小写英文字母、数字或下划线。
zh_hant: 3～32 位小寫英文字母、數字或底線。

# account.design.allHelp
source: All devices will be signed out, including this one. A connection and identity confirmation are required.
ar: سيتم الخروج من جميع الأجهزة، بما فيها هذا الجهاز. يلزم اتصال وتأكيد الهوية.
zh_hans: 所有设备都将退出登录，包括当前设备。此操作需要网络连接及身份确认。
zh_hant: 所有裝置都會登出，包含目前裝置。此操作需要網路連線及身分確認。

# account.design.appearance
source: Appearance
ar: المظهر
zh_hans: 外观
zh_hant: 外觀

# account.design.appearanceHelp
source: Applies to all app windows. Signing out or switching accounts won’t reset this setting.
ar: يسري على جميع نوافذ التطبيق، ولا يُعاد ضبطه عند الخروج أو تبديل الحساب.
zh_hans: 外观设置在所有应用窗口生效，不随退出或切换账号重置。
zh_hant: 外觀設定會套用至所有 App 視窗，不會因登出或切換帳號而重設。

# account.design.appleCancelled
source: Authorization cancelled. You can choose another sign-in method.
ar: تم إلغاء التفويض. يمكنك اختيار طريقة دخول أخرى.
zh_hans: 已取消授权，你可以选择其他登录方式。
zh_hant: 已取消授權，你可以選擇其他登入方式。

# account.design.appleConflict
source: This Apple sign-in is linked to another account. Accounts can’t be merged here.
ar: طريقة دخول Apple مرتبطة بحساب آخر. لا يمكن دمج الحسابين هنا.
zh_hans: 此 Apple 登录方式已关联其他账号，无法直接合并。
zh_hant: 此 Apple 登入方式已連結其他帳號，無法直接合併。

# account.design.appleFailure
source: Apple sign-in couldn’t be completed. Try again.
ar: تعذّر إكمال الدخول باستخدام Apple. حاول مجددًا.
zh_hans: Apple 登录暂时无法完成，请重试。
zh_hant: 暫時無法完成 Apple 登入，請重試。

# account.design.appleHandoff
source: Continue with Apple
ar: المتابعة باستخدام Apple
zh_hans: 继续使用 Apple
zh_hant: 繼續使用 Apple

# account.design.appleLogin
source: Sign in with Apple
ar: تسجيل الدخول باستخدام Apple
zh_hans: 通过 Apple 登录
zh_hant: 透過 Apple 登入

# account.design.appleMethod
source: Apple sign-in
ar: الدخول باستخدام Apple
zh_hans: Apple 登录
zh_hant: Apple 登入

# account.design.available
source: Set up
ar: تم الإعداد
zh_hans: 已设置
zh_hant: 已設定

# account.design.avatar
source: Profile photo
ar: الصورة الشخصية
zh_hans: 头像
zh_hant: 頭像
